app/views/secrets/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 1]]
---
  <h4><%= secret.content %></h4>
  <b><%= secret.likes.count %> likes</b>