app/controllers/secrets_controller.rb

SELECT "secrets".* FROM "secrets"
---
  def index
    @secrets = Secret.all

INSERT INTO "secrets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "I am the bunny "], ["user_id", 4], ["created_at", "2017-04-18 22:31:31.744282"], ["updated_at", "2017-04-18 22:31:31.744282"]]
---
  def create
    @secret = Secret.new(secret_params)
    if @secret.save

SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "secrets" WHERE "secrets"."id" = $1  [["id", 3]]
---
  def destroy
    secret = Secret.find(params[:id])
    secret.destroy if secret.user === current_user