app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @user = User.find(params[:id])
    @secrets = Secret.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "secrets".* FROM "secrets"

  def update
    @user = User.find(params[:id])
    if @user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Carli"], ["email", "losmonster@gmail.com"], ["updated_at", "2017-04-18 21:16:04.183935"], ["id", 3]]